In [3]:
import pandas as pd
import seaborn as sns

In [5]:
df=sns.load_dataset("titanic")

In [6]:
df1=df.copy()

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df["sex"]=df["sex"].replace(["male","female"],[1,0])

C:\Users\PC\AppData\Local\Temp\ipykernel_7388\4104110692.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["sex"]=df["sex"].replace(["male","female"],[1,0])

In [5]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,0,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,0,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,1,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
df=df.drop(["deck"],axis=1)

In [7]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,0,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,0,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,1,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,1,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,0,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,0,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,1,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,1,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [8]:
df["age"]=df["age"].fillna(df["age"].mean())

In [9]:
df=df.dropna()

In [10]:
df.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    int64
 3   age          889 non-null    float64
 4   sibsp        889 non-null    int64
 5   parch        889 non-null    int64
 6   fare         889 non-null    float64
 7   embarked     889 non-null    object
 8   class        889 non-null    category
 9   who          889 non-null    object
 10  adult_male   889 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        889 non-null    object
 13  alone        889 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(5), object(4)
memory usage: 86.1+ KB

In [8]:
df["alone"]=df["alone"].astype("Int64")

In [13]:
df["adult_male"]=df["adult_male"].astype("Int64")

C:\Users\PC\AppData\Local\Temp\ipykernel_7388\2842511702.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["adult_male"]=df["adult_male"].astype("Int64")

In [14]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,S,Third,man,1,Southampton,no,0
1,1,1,0,38.0,1,0,71.2833,C,First,woman,0,Cherbourg,yes,0
2,1,3,0,26.0,0,0,7.9250,S,Third,woman,0,Southampton,yes,1
3,1,1,0,35.0,1,0,53.1000,S,First,woman,0,Southampton,yes,0
4,0,3,1,35.0,0,0,8.0500,S,Third,man,1,Southampton,no,1

In [22]:
#Replace encoding using loop
df1=sns.load_dataset("titanic")

In [24]:
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [40]:
df1["sex"].unique()

array([0, 1])

In [42]:
df1["sex"].unique().tolist()

[0, 1]

In [41]:
df1["sex"].nunique()

2

In [43]:
from pandas.api.types import is_numeric_dtype

In [ ]:
for col in df1.columns:
    if is_numeric_dtype(df1[col]):
        continue
    else:
        uni = df1[col].nunique()
        val = df1[col].unique().tolist()
        if uni == 2:
            df1[col] = df1[col].replace(val, [0, 1])
        elif uni==3:
            df1[col]= df1[col].replace(val, [0,1,2])
        elif uni==4:
            df1[col]= df1[col].replace(val,[0,1,2,3])